# Задача №337. Сумма цифр
# Входные данные
# Вводится натуральное число x.

# Выходные данные
# Выведите сумму цифр числа x.
print(sum([int(a) for a in input()]))